archive/before-2018-11-10/2017-06-28-定制nginx的gunzip模块.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>定制nginx的gunzip模块</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">定制nginx的gunzip模块</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#gunzip">1. gunzip and gzip</a></li>
<li><a href="#org61ccf71">2. 特殊情况的下定制nginx的gunzip模块</a></li>
</ul>
</div>
</div>

<div id="outline-container-org16e1225" class="outline-2">
<h2 id="gunzip"><a id="org16e1225"></a><span class="section-number-2">1</span> gunzip and gzip</h2>
<div class="outline-text-2" id="text-gunzip">
<div class="org-src-container">
<pre class="src src-artist">           +---------------------------+        (3)        +---------------------+
           |                           |&lt;------------------|                     |
           |   Host 2: Nginx proxy     |                   |  Host 3: Upstream   |
           |                           |------------------&gt;|                     |
           +---------------------------+        (2)        +---------------------+
                |                 ^                
            (4) |                 | (1)            
                v                 |     
           +---------------------------+
           |                           |
           |   Host 2: Client          |
           |                           |
           +---------------------------+
</pre>
</div>
<ul class="org-ul">
<li>gzip模块针对上图中的 (4) 。即返回给client的时候进行压缩。</li>
<li>gunzip模块针对 (4) 。返回给client的时候，如果client是老式的不支持
解析压缩数据的客户<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。把这个开关打开后，Host 2中的
nginx会把数据解压后再返回给client。如果client支持解压gzip文件
<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，则Host 2在第 (4) 步的时候不会进行解压。</li>
<li class="on"><code>[X]</code> gzip开启后，第 (2) 步会不会进行压缩？这一步进不进行压缩要考虑两方面。
<ul class="org-ul">
<li><p>
Nginx请求给upstream时有没有加入对应的http头
</p>
<pre class="example">
        "Accept-Encoding: gzip"
</pre></li>
<li>Upstream支不支持压缩数据</li>
</ul></li>
<li class="on"><code>[X]</code> gzip开启后， (3) 压缩了以后，在第 (4) 步会不会进行二次压缩？我
觉得应该不会了</li>
<li class="on"><code>[X]</code> nginx的gunzip对第 (2) 步能不能生效？不会，nginx在host 2上，管
不了host 3上的server。</li>
</ul>
</div>
</div>

<div id="outline-container-org61ccf71" class="outline-2">
<h2 id="org61ccf71"><span class="section-number-2">2</span> 特殊情况的下定制nginx的gunzip模块</h2>
<div class="outline-text-2" id="text-2">
<p>
如果有一个第三方定制模块 <code>my_module</code> ，每次upstream返回给客户的数据
它都需要做一些加工处理。这种情况下，如果upstream返回的是压缩后的数据，
<code>my_module</code> 处理不了。
</p>

<p>
以 <a href="#gunzip">1</a> 的图为例，现在 <code>my_module</code> 要求upstream (3) 回的消息不能
是zip过的。
</p>

<p>
现在使用nginx的gunzip模块，在我们 <code>my_module</code> 模块去处理upstream的
reponse之前对reponse先做处理，如果是zip的文件，就先unzip后再给
=my_module=模块处理。
</p>

<p>
支持这样的功能后，upstream可以通过压缩数据的方式减少upstream到proxy
（内网）的网络流量<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>。
</p>

<p>
修改点：
</p>
<ol class="org-ol">
<li>编译nginx时，需要修改modules的加载顺序，使gunzip在 <code>my_module</code> 之
前加载<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>。</li>
<li><p>
默认gunzip中有一个判断，如果客户发起的请求中显示有
<code>Accept-encoding: gzip</code> 这样的http header。表示客户支持解压zip文
件。这时默认gunzip模块不会对upstream传回来的压缩后的zip文件进行解
压的。这不符合我们的使用要求（我们要求是zip的数据就全部都解压让我
们的 <code>my_module</code> 处理）。于是我们修改了一下原始的gunzip模块，如果
加载了我们的模块，则对response全部都做解压。然后再交给
<code>my_module</code> 模块处理。
</p>
<div class="org-src-container">
<pre class="src src-C">       <span style="color: #a1db00;">static</span> <span style="color: #00d7af;">ngx_int_t</span>
       <span style="color: #ffd700;">ngx_http_gunzip_header_filter</span>(<span style="color: #00d7af;">ngx_http_request_t</span> *<span style="color: #ff8700;">r</span>)
       {

           <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">... </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
           <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>r-&gt;gzip_tested) {
               <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#22312;&#36825;&#37324;&#20570;&#30340;&#21028;&#26029; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
               <span style="color: #a1db00;">if</span> (ngx_http_gzip_ok(r) == NGX_OK) {
                   <span style="color: #a1db00;">return</span> ngx_http_next_header_filter(r);
               }

           }
           <span style="color: #a1db00;">else</span> <span style="color: #a1db00;">if</span> (r-&gt;gzip_ok) {
               <span style="color: #a1db00;">return</span> ngx_http_next_header_filter(r);
           }
       }
</pre>
</div>
<p>
修改为：
</p>
<div class="org-src-container">
<pre class="src src-C">       <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>r-&gt;gzip_tested) {
           <span style="color: #a1db00;">if</span> (ngx_http_gzip_ok(r) == NGX_OK) {
               <span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;">                * Always unzip the gzip stream from upstream before</span>
<span style="color: #ff4b4b;">                * it send to RAS modules.</span>
<span style="color: #ff4b4b;">                */</span>
               <span style="color: #a1db00;">if</span> (r-&gt;headers_in.gunzip) {
                   r-&gt;gzip_tested = 1;
               }
               <span style="color: #a1db00;">else</span> {
                   <span style="color: #a1db00;">return</span> ngx_http_next_header_filter(r);
               }
           }

       } <span style="color: #a1db00;">else</span> <span style="color: #a1db00;">if</span> (r-&gt;gzip_ok) {
</pre>
</div>
<p>
在结构体 <code>ngx_http_headers_in_t</code> 里面添加 <code>gunzip</code> 位。如果配置文
件中设置了 <code>gunzip on</code> ，则它的值应不为0。
</p>
<div class="org-src-container">
<pre class="src src-C">       <span style="color: #a1db00;">typedef</span> <span style="color: #a1db00;">struct</span> {
           <span style="color: #00d7af;">ngx_list_t</span>                        <span style="color: #ff8700;">headers</span>;
           <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">... </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
           <span style="color: #00d7af;">unsigned</span>                          <span style="color: #ff8700;">gunzip</span>:2;
       } <span style="color: #00d7af;">ngx_http_headers_in_t</span>;
</pre>
</div></li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">比如curl。</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">如chrome。</div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara">因为有些用户服务器可能出现cpu没满而网卡满了
的情况。</div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara">当前默认编译时，gunzip在第三方filter模块 <code>my_module</code>
之后。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>